/***********************************************************************//**
 *	PrpzlOperationData.h
 *	Enlight Game Application
 *
 *	Created by Ryoutarou Kishi on 2011/02/13.
 *	Copyright 2011 Altoterras Corporation. All rights reserved.
 *
**//***********************************************************************/

#ifndef _SRCR_PUREPUZZLE_PRPZL_CONF_H_
#define _SRCR_PUREPUZZLE_PRPZL_CONF_H_

////////////////////////////////////////////////////////////////////////////
// インクルードファイル

#include "../Base.h"

////////////////////////////////////////////////////////////////////////////
// クラス

TFW_BEGIN_NS

TFW_END_NS

SRCR_BEGIN_NS

/*---------------------------------------------------------------------*//**
 *	パズル動作データ
 *
**//*---------------------------------------------------------------------*/
class PrpzlOperationData
{
	//======================================================================
	// 定数
public:
	// パズルモード
	enum PzlMode
	{
		PZLMODE_NULL,
		PZLMODE_VS_CPU,		// CPU と対戦
		PZLMODE_VS_2P,		// ２人で対戦
		PZLMODE_INF_1P,		// １人でプレイ
		PZLMODE_QUEST,		// 問題形式パズル
	};
	
	// 対面方法
	enum VsFace
	{
		VSFACE_SIDE,		// 横並び
		VSFACE_FACE,		// 向かい合う
	};

	//======================================================================
	// クラス
public:
	/*-----------------------------------------------------------------*//**
	 *	設定
	 *
	**//*-----------------------------------------------------------------*/
	class Config
	{
	public:
		PzlMode _pzlmode;		// パズルモード
		VsFace _vsface;			// 対面方法
		s32 _questNo;			// クエスト番号

		Config()
			: _pzlmode(PZLMODE_NULL)
			, _vsface(VSFACE_SIDE)
			, _questNo(0)
		{
		}
	};

	//======================================================================
	// メソッド

	// - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
	// 内部制御
public:
	PrpzlOperationData()
	{
	}

	//======================================================================
	// 変数
public:
	Config _conf;
};

SRCR_END_NS

////////////////////////////////////////////////////////////////////////////

#endif	// _SRCR_PUREPUZZLE_PRPZL_CONF_H_
