/***********************************************************************//**
 *	QsMod10103.h
 *	Enlight Game Application
 *
 *	Created by Ryoutarou Kishi on 2011/01/07.
 *	Copyright 2011 Altoterras Corporation. All rights reserved.
 *
**//***********************************************************************/

#ifndef _SRCR_EPISODE_QSMOD_IMPLEMENT_QS_MOD_10103_H_
#define _SRCR_EPISODE_QSMOD_IMPLEMENT_QS_MOD_10103_H_

////////////////////////////////////////////////////////////////////////////
// インクルードファイル

#include "../../../quest/qsmod/QsMod.h"

////////////////////////////////////////////////////////////////////////////
// クラス

SRCR_BEGIN_NS

/*---------------------------------------------------------------------*//**
 *	クエスト 10103 モジュール
 *
**//*---------------------------------------------------------------------*/
class QsMod10103 : public QsMod
{
	//======================================================================
	// 定数
private:
	static const u32 CTRLEVID_HERB_03 = 51012;		// ハーブ３

	//======================================================================
	// メソッド

	// - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
	// 内部制御
public:
	void exec(ExecRes* res, const ExecCtx* ec);
};

////////////////////////////////////////////////////////////////////////////

SRCR_END_NS

#endif	// _SRCR_EPISODE_QSMOD_IMPLEMENT_QS_MOD_10103_H_
