/***********************************************************************//**
 *	QsMod10102.h
 *	Enlight Game Application
 *
 *	Created by Ryoutarou Kishi on 2010/12/09.
 *	Copyright 2010 Altoterras Corporation. All rights reserved.
 *
**//***********************************************************************/

#ifndef _SRCR_EPISODE_QSMOD_IMPLEMENT_QS_MOD_10102_H_
#define _SRCR_EPISODE_QSMOD_IMPLEMENT_QS_MOD_10102_H_

////////////////////////////////////////////////////////////////////////////
// インクルードファイル

#include "../../../quest/qsmod/QsMod.h"

////////////////////////////////////////////////////////////////////////////
// クラス

SRCR_BEGIN_NS

/*---------------------------------------------------------------------*//**
 *	クエスト 10102 モジュール
 *
**//*---------------------------------------------------------------------*/
class QsMod10102 : public QsMod
{
	//======================================================================
	// メソッド

	// - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
	// 内部制御
public:
	void exec(ExecRes* res, const ExecCtx* ec);
};

////////////////////////////////////////////////////////////////////////////

SRCR_END_NS

#endif	// _SRCR_EPISODE_QSMOD_IMPLEMENT_QS_MOD_10102_H_
