/***********************************************************************//**
 *	MsgData.h
 *	Terras Framework
 *
 *	Created by Ryoutarou Kishi on 2009/12/07.
 *	Copyright 2009 Altoterras Corporation. All rights reserved.
 *
**//***********************************************************************/

#ifndef _TFW_MSG_DATA_H_
#define _TFW_MSG_DATA_H_

////////////////////////////////////////////////////////////////////////////
// インクルードファイル

// Base
#include "../Base.h"

// Friends
#include "../string/VcString.h"

////////////////////////////////////////////////////////////////////////////
// 構造体

TFW_BEGIN_NS

class FileBase;

/*
	メッセージデータ フォーマット

	MsgDataHeader
	{MsgDataArray} = MsgData * MsgDataHeader._numMsg
	{MessageString} = (VcString)
*/

/*---------------------------------------------------------------------*//**
 *	メッセージデータ ヘッダー構造体
 *	
**//*---------------------------------------------------------------------*/
struct EnlightEventMsgDataHeader
{
	//======================================================================
	// 変数

	// [ 0 ]
	u16			_numMsg;				// メッセージ数
	u8			__pad_0010[ 2 ];
	u32			_lenString;				// 文字列の長さ
	u8			__pad_0020[ 8 ];
	// [ 16 ]

	//======================================================================
	// 定数

	static const s32	SIZE_THIS						= 16;
};

/*---------------------------------------------------------------------*//**
 *	メッセージデータ構造体
 *	
**//*---------------------------------------------------------------------*/
struct EnlightEventMsgData
{
	//======================================================================
	// 変数

	// [ 0 ]
	u16			_msgid;					// メッセージ ID
	u16			_param1;				// 汎用パラメータ１
	u16			_indexStart;			// 文字列の開始インデックス
	u16			_indexEnd;				// 文字列の終了インデックス（含まれない）
	u8			__pad_0010[ 8 ];

	// [ 16 ]

	//======================================================================
	// 定数

	static const s32	SIZE_THIS						= 16;
};

////////////////////////////////////////////////////////////////////////////
// クラス

/*---------------------------------------------------------------------*//**
 *	メッセージ データ
 *	
**//*---------------------------------------------------------------------*/
class MsgData
{
	//======================================================================
	// クラス
public:
	/*-----------------------------------------------------------------*//**
	 *	１メッセージ
	 *	
	**//*-----------------------------------------------------------------*/
	class Msg
	{
	public:
		u16 _msgid;					// メッセージ ID
		u16 _param1;				// 汎用パラメータ１
		u16 _indexStart;			// 文字列の開始インデックス
		u16 _indexEnd;				// 文字列の終了インデックス（含まれない）
		u16 _catid;					// オーナークラスでのカテゴリ ID
	};

	/*-----------------------------------------------------------------*//**
	 *	検索ヒント
	 *	
	**//*-----------------------------------------------------------------*/
	class FindHint
	{
	public:
		s32 _index;

	public:
		FindHint() : _index(0) {}
	};

	//======================================================================
	// メソッド

	// - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
	// アクセサ
public:
	VcString getString(const Msg* msg) const;

	// - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
	// 外部サービス
public:
	const Msg* findMessageFromMsgid(u16 msgid) const;
	const Msg* findMessageFromMsgid(u16 msgid, FindHint* hint) const;

	// - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
	// 内部制御
public:
	MsgData();
	~MsgData();
	bool create(u16 catid, FileBase* file, u16 ofsMsgid);
	void destroy();

	//======================================================================
	// 変数
private:
	Msg*		_marrMsg;
	s32			_numMsg;
	VcString*	_strAll;
};

TFW_END_NS

////////////////////////////////////////////////////////////////////////////

#endif	// _TFW_MSG_DATA_H_
