/***********************************************************************//**
 *	Debug.cpp
 *	Enlight Game Application
 *
 *	Created by Ryoutarou Kishi on 2009/06/03.
 *	Copyright 2009 Altoterras Corporation. All rights reserved.
 *
**//***********************************************************************/

////////////////////////////////////////////////////////////////////////////
// インクルードファイル

// Base

// Self
#include "EsDebug.h"

// External
#include "../tfw/debug/TfwDebug.h"

// Library
#include <stdarg.h>
#include <stdio.h>

////////////////////////////////////////////////////////////////////////////
// クラス

namespace es
{

//==========================================================================
// Debug メソッド

/*---------------------------------------------------------------------*//**
	@brief		デバッグコンソール出力
	@param		pstr メッセージ文字列
**//*---------------------------------------------------------------------*/
void Debug::trace(const tfw::CStringBase* str)
{
	tfw::TfwDebug::trace(str);
}

/*---------------------------------------------------------------------*//**
	@brief		デバッグコンソール出力
	@param		pstr メッセージ文字列
**//*---------------------------------------------------------------------*/
void Debug::trace(const char* str)
{
	tfw::TfwDebug::trace(str);
}

/*---------------------------------------------------------------------*//**
	@brief		アサーション
	@param		isValid 判定真偽値
**//*---------------------------------------------------------------------*/
void Debug::assert(bool isValid)
{
	tfw::TfwDebug::assert(isValid);
}

/*---------------------------------------------------------------------*//**
	@brief		アサーション
	@param		isValid 判定真偽値
	@param		pmsg メッセージ文字列
**//*---------------------------------------------------------------------*/
void Debug::assert(bool isValid, const char* pmsg)
{
	tfw::TfwDebug::assert(isValid, pmsg);
}

/*---------------------------------------------------------------------*//**
	@brief		デバッグモードか否か
	@retval		true デバッグモードである
	@retval		false デバッグモードでない
**//*---------------------------------------------------------------------*/
bool Debug::isDebugMode()
{
	return tfw::TfwDebug::isDebugMode();
}

}	// namespace sourcerer

////////////////////////////////////////////////////////////////////////////
