/***********************************************************************//**
 *	EsObjectBox.cpp
 *	Enlight Script
 *
 *	Created by Ryoutarou Kishi on 2011/02/02.
 *	Copyright 2010 Altoterras Corporation. All rights reserved.
 *
**//***********************************************************************/

////////////////////////////////////////////////////////////////////////////
// インクルードファイル

// Base

// Self
#include "EsObjectBox.h"

// Friends

// External

ES_BEGIN_NS

////////////////////////////////////////////////////////////////////////////
// クラス

//==========================================================================
// EsObjectBox メソッド

// - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
// 外部サービス

/*---------------------------------------------------------------------*//**
	セットアップ
**//*---------------------------------------------------------------------*/
void EsObjectBox::setup(EsObject* objBlock, EsObjectBox* objboxTraceLink, EsObjectBox* objboxEmitLink)
{
	_obj = objBlock;
#if ENABLE_OB_LINK
	_traceLink = objboxTraceLink;
	_emitLink = objboxEmitLink;
#endif
}

// - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
// 内部制御

/*---------------------------------------------------------------------*//**
	コンストラクタ
**//*---------------------------------------------------------------------*/
EsObjectBox::EsObjectBox()
	: _obj(0L)
#if ENABLE_OB_LINK
	, _traceLink(0L)
	, _emitLink(0L)
#endif
{
}

////////////////////////////////////////////////////////////////////////////

ES_END_NS
