/***********************************************************************//**
 *	MapEmp_10221_1001_LostCheck.h
 *	Enlight Game Application
 *
 *	Created by Ryoutarou Kishi on 2010/03/29.
 *	Copyright 2010 Altoterras Corporation. All rights reserved.
 *
**//***********************************************************************/

#ifndef _SRCR_EPISODE_MAPEMP_IMPLEMENT_MAP_EMP_10221_1001_LOST_CHECK_H_
#define _SRCR_EPISODE_MAPEMP_IMPLEMENT_MAP_EMP_10221_1001_LOST_CHECK_H_

////////////////////////////////////////////////////////////////////////////
// インクルードファイル

#include "../MapEmp.h"

////////////////////////////////////////////////////////////////////////////
// クラス

SRCR_BEGIN_NS

/*---------------------------------------------------------------------*//**
 *	村入口での対決敗北チェック
 *
**//*---------------------------------------------------------------------*/
class MapEmp_10221_1001_LostCheck : public MapEmp
{
	//======================================================================
	// メソッド

	// - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
	// 内部制御
public:
	MapEmp_10221_1001_LostCheck();
	void begin(u32 param);
};

SRCR_END_NS

////////////////////////////////////////////////////////////////////////////

#endif	// _SRCR_EPISODE_MAPEMP_IMPLEMENT_MAP_EMP_10221_1001_LOST_CHECK_H_
