/***********************************************************************//**
 *	MapMod10221.h
 *	Enlight Game Application
 *
 *	Created by Ryoutarou Kishi on 2010/04/16.
 *	Copyright 2010 Altoterras Corporation. All rights reserved.
 *
**//***********************************************************************/

#ifndef _SRCR_EPISODE_MAPMOD_IMPLEMENT_MAP_MOD_10221_H_
#define _SRCR_EPISODE_MAPMOD_IMPLEMENT_MAP_MOD_10221_H_

////////////////////////////////////////////////////////////////////////////
// インクルードファイル

#include "MapMod10000.h"

////////////////////////////////////////////////////////////////////////////
// クラス

SRCR_BEGIN_NS

/*---------------------------------------------------------------------*//**
 *	マップ 10221 村入口
 *
**//*---------------------------------------------------------------------*/
class MapMod10221 : public MapMod10000
{
	//======================================================================
	// メソッド

	// - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
	// 内部制御
public:
	MapMod10221();
	void exec(ExecRes* res, const ExecCtx* ec);	// フレーム制御

	//======================================================================
	// 変数
private:
	s32 _cntKeep;
};

////////////////////////////////////////////////////////////////////////////

SRCR_END_NS

#endif	// _SRCR_EPISODE_MAPMOD_IMPLEMENT_MAP_MOD_10221_H_
