/***********************************************************************//**
 *	MapMod19102.h
 *	Enlight Game Application
 *
 *	Created by Ryoutarou Kishi on 2010/08/04.
 *	Copyright 2010 Altoterras Corporation. All rights reserved.
 *
**//***********************************************************************/

#ifndef _SRCR_EPISODE_MAPMOD_IMPLEMENT_MAP_MOD_19102_H_
#define _SRCR_EPISODE_MAPMOD_IMPLEMENT_MAP_MOD_19102_H_

////////////////////////////////////////////////////////////////////////////
// インクルードファイル

#include "MapMod10000.h"

////////////////////////////////////////////////////////////////////////////
// クラス

SRCR_BEGIN_NS

/*---------------------------------------------------------------------*//**
 *	マップ 19102 デバッグマップ
 *
**//*---------------------------------------------------------------------*/
class MapMod19102 : public MapMod10000
{
	//======================================================================
	// メソッド

	// - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
	// 内部制御
public:
	MapMod19102();
	bool begin();
	bool end();
	void exec(ExecRes* res, const ExecCtx* ec);	// フレーム制御
	
	//======================================================================
	// 変数
private:
};

////////////////////////////////////////////////////////////////////////////

SRCR_END_NS

#endif	// _SRCR_EPISODE_MAPMOD_IMPLEMENT_MAP_MOD_19102_H_
