/***********************************************************************//**
 *	MapMod11104.cpp
 *	Enlight Game Application
 *
 *	Created by Ryoutarou Kishi on 2010/04/16.
 *	Copyright 2010 Altoterras Corporation. All rights reserved.
 *
**//***********************************************************************/

////////////////////////////////////////////////////////////////////////////
// インクルードファイル

// Base

// Self
#include "MapMod11104.h"

// Friends
#include "../../../episode/party/MyParty.h"
#include "../../../body/Game.h"
#include "../../../unit/char/pc/PcUnit.h"

// External
#include "../../../../tfw/lib/Vector.h"

// Library

////////////////////////////////////////////////////////////////////////////

SRCR_BEGIN_NS

////////////////////////////////////////////////////////////////////////////
// 定数

////////////////////////////////////////////////////////////////////////////
// クラス

//==========================================================================
// MapMod11104 メソッド

// - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
// 内部制御

/*---------------------------------------------------------------------*//**
	コンストラクタ
**//*---------------------------------------------------------------------*/
MapMod11104::MapMod11104()
{
}

/*---------------------------------------------------------------------*//**
	フレーム処理
**//*---------------------------------------------------------------------*/
void MapMod11104::exec(ExecRes* res, const ExecCtx* ec)
{
	// Vol01 行動制限のための地面当たり編集
	Unit* unitMy = Game::getGame()->getMyParty()->pcUnit(MyParty::PC_MY);
	if(unitMy != 0L)
	{
		const Vector3F* posMy = unitMy->getPosition();
		// 一定位置より近づけない
		const f32 X_LIMIT = 2000.0f;
		if(posMy->x() < X_LIMIT)
		{
			Vector3F posNew(posMy);
			posNew.x() = X_LIMIT;
			unitMy->setPosition(&posNew);
		}
	}

	MapMod10000::exec(res, ec);
}

////////////////////////////////////////////////////////////////////////////

SRCR_END_NS
