/***********************************************************************//**
 *	Test.h
 *	Envelopment Terras Kit
 *
 *	Created by Ryoutarou Kishi on 2013/06/28.
 *	Copyright 2013 Altoterras Corporation. All rights reserved.
 *
**//***********************************************************************/

#ifndef _ETK_DEBUG_ETK_DEBUG_H_
#define _ETK_DEBUG_ETK_DEBUG_H_

////////////////////////////////////////////////////////////////////////////
// インクルードファイル

#include "../Base.h"

////////////////////////////////////////////////////////////////////////////
// グローバル関数

ETK_BEGIN_NS

ETK_END_NS

////////////////////////////////////////////////////////////////////////////

#endif	// _ETK_DEBUG_ETK_DEBUG_H_
