/***********************************************************************//**
 *	StopWatch.h
 *	Terras Framework
 *	
 *	Created by Ryoutarou Kishi on 2009/09/11.
 *	Copyright 2009 Altoterras Corporation. All rights reserved.
 *
**//***********************************************************************/

#ifndef _TFW_LIB_STOP_WATCH_H_
#define _TFW_LIB_STOP_WATCH_H_

////////////////////////////////////////////////////////////////////////////
// インクルードファイル

#include "../Base.h"

////////////////////////////////////////////////////////////////////////////
// クラス

TFW_BEGIN_NS

/*---------------------------------------------------------------------*//**
 *	ストップウォッチ基底クラス
 *	
**//*---------------------------------------------------------------------*/
class StopWatch
{
public:
	virtual void	start() = 0;
	virtual f32		getElapsedSeconds() = 0;
};

TFW_END_NS

////////////////////////////////////////////////////////////////////////////
	
#endif	// _TFW_LIB_STOP_WATCH_H_

