/***********************************************************************//**
 *	TmpBuf.h
 *	Terras Framework
 *	
 *	Created by Ryoutarou Kishi on 2012/12/07.
 *	Copyright 2012 Altoterras Corporation. All rights reserved.
 *
**//***********************************************************************/

#ifndef _TFW_LIB_TMP_BUF_H_
#define _TFW_LIB_TMP_BUF_H_

////////////////////////////////////////////////////////////////////////////
// インクルードファイル

#include "../Base.h"

////////////////////////////////////////////////////////////////////////////
// クラス

TFW_BEGIN_NS

/*---------------------------------------------------------------------*//**
 *	一時バッファ
 *		可能な限りスタックをバッファとして用いるためのヘルパークラス
 *
**//*---------------------------------------------------------------------*/
class TmpBuf
{
	//======================================================================
	// 定数
private:
	static const u8		F_USE_STACK	= 0x01;

	//======================================================================
	// メソッド

	// - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
	// アクセサ
public:
	// バッファ取得
	inline u8* get() const { return _buf; }
	// サイズ取得
	inline u32 getSize() const { return _size; }

	// - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
	// 外部サービス
public:
	u8* make(u32 sizeNeed, u8* bufStack, u32 sizeStackBuf);

	// - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
	// 内部制御
public:
	TmpBuf();
	TmpBuf(u32 sizeNeed, u8* bufStack, u32 sizeStackBuf);
	~TmpBuf();

	//======================================================================
	// 変数
private:
	u8* _buf;
	u32 _size;
	u8 _flags;
};

TFW_END_NS

////////////////////////////////////////////////////////////////////////////
	
#endif	// _TFW_LIB_TMP_BUF_H_

