/***********************************************************************//**
 *  PsnsWin.cpp
 *  Enlight Windows Application
 *
 *	Created by Ryoutarou Kishi on 2012/04/14.
 *	Copyright 2012 Altoterras Corporation. All rights reserved.
 *
**//***********************************************************************/

////////////////////////////////////////////////////////////////////////////
// インクルードファイル

// Base

// Self
#include "PsnsWin.h"

// Friends
#include "../tfw/string/VcString.h"

// External

// Library

////////////////////////////////////////////////////////////////////////////

namespace app
{

////////////////////////////////////////////////////////////////////////////
// クラス

//==========================================================================
// PsnsWin メソッド

// - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
// 外部サービス

/*---------------------------------------------------------------------*//**
	現在のプレイヤー名を得る
**//*---------------------------------------------------------------------*/
bool PsnsWin::getCurrentPlayerId(tfw::VcString* idstr) const
{
#if defined(_DEBUG)
	if(!_validUserTest)	{	return false;	}
	*idstr = "###test_user_id###";	// test
	return true;
#else
	return false;
#endif
}

/*---------------------------------------------------------------------*//**
	スコアを更新する
**//*---------------------------------------------------------------------*/
bool PsnsWin::updateScore(u32 score)
{
	return false;
}

/*---------------------------------------------------------------------*//**
	トロフィーを更新する
**//*---------------------------------------------------------------------*/
bool PsnsWin::updateTrophy(s32 itp, u8 rate)
{
	return false;
}

/*---------------------------------------------------------------------*//**
	全トロフィーをリセットする
**//*---------------------------------------------------------------------*/
bool PsnsWin::resetTrophies()
{
	return false;
}

/*---------------------------------------------------------------------*//**
	有効な PSNS ユーザーアカウントがログインされているか
**//*---------------------------------------------------------------------*/
bool PsnsWin::isValidUserAccount()
{
#if defined(_DEBUG)
	return _validUserTest;
#else
	return false;
#endif
}

/*---------------------------------------------------------------------*//**
	PSNS ホーム画面を表示する
**//*---------------------------------------------------------------------*/
bool PsnsWin::showPsnsScreen(ScreenKind sk)
{
	::MessageBox(NULL, TEXT("not supported"), TEXT("error!"), 0);
	return false;
}

#if defined(_DEBUG)
/*---------------------------------------------------------------------*//**
	強制ユーザーアカウント有効性変更
**//*---------------------------------------------------------------------*/
void PsnsWin::debug_changeValidationUserAccountTest(bool validUser)
{
	_validUserTest = validUser;
}
#endif

// - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
// 内部制御

/*---------------------------------------------------------------------*//**
	コンストラクタ
**//*---------------------------------------------------------------------*/
PsnsWin::PsnsWin()
#if defined(_DEBUG)
	: _validUserTest(false)
#endif
{
}

////////////////////////////////////////////////////////////////////////////

}	// namespace app
