/***********************************************************************//**
 *	CharDefTbl.cpp
 *	Enlight Game Application
 *
 *	Created by Ryoutarou Kishi on 2010/05/12.
 *	Copyright 2010 Altoterras Corporation. All rights reserved.
 *
**//***********************************************************************/

////////////////////////////////////////////////////////////////////////////
// インクルードファイル

// Base

// Self
#include "CharDefTbl.h"

// Friends

// External
#include "../../tfw/file/IdFile.h"

SRCR_BEGIN_NS

////////////////////////////////////////////////////////////////////////////
// クラス

//==========================================================================
// メソッド

// - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
// アクセサ

/*---------------------------------------------------------------------*//**
	キャラクター定義を取得する
**//*---------------------------------------------------------------------*/
const CharDef* CharDefTbl::getDef(u16 chrdid) const
{
	for(s32 i = 0; i < NUM_CHARDEF_MAX; i++)
	{
		if(_chrdefarr[i].getCharDefId() == chrdid)
		{
			return &_chrdefarr[i];
		}
	}
	return 0L;
}

// - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
// 外部サービス

// - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
// 内部制御

/*---------------------------------------------------------------------*//**
	コンストラクタ
**//*---------------------------------------------------------------------*/
CharDefTbl::CharDefTbl()
{
}

/*---------------------------------------------------------------------*//**
	デストラクタ
**//*---------------------------------------------------------------------*/
CharDefTbl::~CharDefTbl()
{
}

/*---------------------------------------------------------------------*//**
	初期化
**//*---------------------------------------------------------------------*/
bool CharDefTbl::init(u32 fileidData, u32 fileidStr)
{
	s32 numCharDef = 0;

	// データファイルを開く
	{
		IdFile file(fileidData);
		if(file.isOpened())
		{
			do
			{
				// キャラクター定義の数
				u32 sizeRead = file.read(&numCharDef, sizeof(u32));
				if(sizeRead != sizeof(u32))
				{
					ASSERT(false);
					break;
				}
				ASSERT(numCharDef <= NUM_CHARDEF_MAX);

				// キャラクター定義ごとにデータを読み込む
				for(s32 i = 0; i < numCharDef; i++)
				{
					if(!_chrdefarr[i].loadFromDataFile(&file))
					{
						break;
					}
				}
			}
			while(false);

			// ファイルを閉じる
			file.close();
		}
	}

	// 文字列ファイルを開く
	{
		IdFile file(fileidStr);
		if(file.isOpened())
		{
			// キャラクター定義ごとにデータを読み込む
			for(s32 i = 0; i < numCharDef; i++)
			{
				if(!_chrdefarr[i].loadFromStringFile(&file))
				{
					break;
				}
			}

			// ファイルを閉じる
			file.close();
		}
	}

	return true;
}

/*---------------------------------------------------------------------*//**
	解放
**//*---------------------------------------------------------------------*/
void CharDefTbl::cleanup()
{
	for(s32 i = 0; i < NUM_CHARDEF_MAX; i++)
	{
		_chrdefarr[i].cleanup();
	}
}

////////////////////////////////////////////////////////////////////////////

SRCR_END_NS
