/***********************************************************************//**
 *	TexAnimCtx.h
 *	Terras Framework
 *
 *	Created by Ryoutarou Kishi on 2009/12/29.
 *	Copyright 2009 Altoterras Corporation. All rights reserved.
 *
**//***********************************************************************/

#ifndef _TFW_GCMN_TEX_ANIM_CTX_H_
#define _TFW_GCMN_TEX_ANIM_CTX_H_

////////////////////////////////////////////////////////////////////////////
// インクルードファイル

#include "../Base.h"

////////////////////////////////////////////////////////////////////////////
// クラス

TFW_BEGIN_NS

/*---------------------------------------------------------------------*//**
 *	テクスチャ アニメーション 可変値コンテキスト
 *
**//*---------------------------------------------------------------------*/
class TexAnimCtx
{
	// - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
	// 内部制御
public:
	TexAnimCtx();
	virtual ~TexAnimCtx();
	bool create();
	void destroy();

	//======================================================================
	// メンバ変数
public:
	f32				_frameCur;
	u32				_idxKeyFrame;
};

TFW_END_NS

////////////////////////////////////////////////////////////////////////////

#endif	// _TFW_GCMN_TEX_ANIM_CTX_H_