/***********************************************************************//**
 *	TextureCtx.h
 *	Terras Framework
 *
 *	Created by Ryoutarou Kishi on 2009/12/29.
 *	Copyright 2009 Altoterras Corporation. All rights reserved.
 *
**//***********************************************************************/

#ifndef _TFW_GCMN_TEXTURE_CTX_H_
#define _TFW_GCMN_TEXTURE_CTX_H_

////////////////////////////////////////////////////////////////////////////
// インクルードファイル

#include "../Base.h"

////////////////////////////////////////////////////////////////////////////
// クラス

TFW_BEGIN_NS

class TexAnim;
class TexAnimCtx;

/*---------------------------------------------------------------------*//**
 *	テクスチャ 可変値コンテキスト
 *
**//*---------------------------------------------------------------------*/
class TextureCtx
{
	// - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
	// 内部制御
public:
	TextureCtx();
	virtual ~TextureCtx();
	bool create(TexAnim* texanim);
	void destroy();

	//======================================================================
	// メンバ変数
public:
	TexAnimCtx*	_tactx;
};

TFW_END_NS

////////////////////////////////////////////////////////////////////////////

#endif	// _TFW_GCMN_TEXTURE_CTX_H_