/***********************************************************************//**
 *	Base.h
 *	Envelopment Terras Kit
 *
 *	Created by Ryoutarou Kishi on 2009/04/13.
 *	Copyright 2009 Altoterras Corporation. All rights reserved.
 *
**//***********************************************************************/

#ifndef _ETK_BASE_H_
#define _ETK_BASE_H_

////////////////////////////////////////////////////////////////////////////
// インクルードファイル

#include "../tfw/Base.h"

#include "body/Env.h"

////////////////////////////////////////////////////////////////////////////
// ネームスペース

namespace tfw {}
using namespace tfw;
namespace sourcerer {}
using namespace sourcerer;

////////////////////////////////////////////////////////////////////////////
// 定数

#define ETK_ASPECT_3_2	(1.5f)
#define ETK_ASPECT_4_3	(4.0f / 3.0f)

////////////////////////////////////////////////////////////////////////////
// マクロ

//==========================================================================
// 定義用

#define ETK_BEGIN_NS namespace etk {
#define ETK_END_NS }

////////////////////////////////////////////////////////////////////////////

#endif	// _ETK_BASE_H_