/***********************************************************************//**
 *	ExtraSpirit.h
 *	Enlight Game Application
 *
 *	Created by Ryoutarou Kishi on 2010/06/24.
 *	Copyright 2010 Altoterras Corporation. All rights reserved.
 *
**//***********************************************************************/

#ifndef _SRCR_SPIRIT_CHAR_NPC_EXTRA_SPIRIT_H_
#define _SRCR_SPIRIT_CHAR_NPC_EXTRA_SPIRIT_H_

////////////////////////////////////////////////////////////////////////////
// インクルードファイル

#include "../../Spirit.h"

////////////////////////////////////////////////////////////////////////////
// クラス

SRCR_BEGIN_NS

class ExtraUnit;

/*---------------------------------------------------------------------*//**
 *	脇役スピリット
 *
**//*---------------------------------------------------------------------*/
class ExtraSpirit : public Spirit
{
	//======================================================================
	// クラス
public:

	//======================================================================
	// 定数
public:

	//======================================================================
	// メソッド

	// - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
	// アクセサ
public:
	// ユニットを得る
	inline ExtraUnit* getThisUnit() const { return (ExtraUnit*)getUnit(); }

	// - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
	// 外部サービス
public:

	// - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
	// 内部制御
public:
	ExtraSpirit();
	virtual ~ExtraSpirit();
	virtual bool create();
	virtual void exec(ExecRes* res, const ExecCtx* ec);	// フレーム制御

	//======================================================================
	// 変数
protected:
};

SRCR_END_NS

////////////////////////////////////////////////////////////////////////////

#endif	// _SRCR_SPIRIT_CHAR_NPC_EXTRA_SPIRIT_H_
