/***********************************************************************//**
 *	GameExecCtx.cpp
 *	Enlight Game Application
 *
 *	Created by Ryoutarou Kishi on 2009/06/03.
 *	Copyright 2009 Altoterras Corporation. All rights reserved.
 *
**//***********************************************************************/

////////////////////////////////////////////////////////////////////////////
// インクルードファイル

// Base

// Self
#include "GameExecCtx.h"

// Friends
#include "Game.h"
#include "../event/EventSys.h"

// External

// Library

////////////////////////////////////////////////////////////////////////////

SRCR_BEGIN_NS

////////////////////////////////////////////////////////////////////////////
// クラス

//==========================================================================
// GameExecCtx メソッド

// - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
// 外部サービス

/*---------------------------------------------------------------------*//**
	イベント等による操作ロック中かを得る
**//*---------------------------------------------------------------------*/
bool GameExecCtx::isLockOperating() const
{
	return Game::getGame()->getEventSys()->isOperationLock();
}

/*---------------------------------------------------------------------*//**
	ダウン防止中かどうかを得る
**//*---------------------------------------------------------------------*/
bool GameExecCtx::isPreventDown() const
{
	return Game::getGame()->getEventSys()->isPareventDown();
}

////////////////////////////////////////////////////////////////////////////

SRCR_END_NS
