/***********************************************************************//**
 *	StEmp_10202_1001_AsaOnlyEvent.h
 *	Enlight Game Application
 *
 *	Created by Ryoutarou Kishi on 2010/03/29.
 *	Copyright 2010 Altoterras Corporation. All rights reserved.
 *
**//***********************************************************************/

#ifndef _SRCR_EPISODE_STEMP_IMPLEMENT_ST_EMP_10202_1001_ASA_ONLY_EVENT_H_
#define _SRCR_EPISODE_STEMP_IMPLEMENT_ST_EMP_10202_1001_ASA_ONLY_EVENT_H_

////////////////////////////////////////////////////////////////////////////
// インクルードファイル

#include "../StEmp.h"

////////////////////////////////////////////////////////////////////////////
// クラス

SRCR_BEGIN_NS

/*---------------------------------------------------------------------*//**
 *	アサのみのときのみ起動するイベント用マター
 *
**//*---------------------------------------------------------------------*/
class StEmp_10202_1001_AsaOnlyEvent : public StEmp
{
	//======================================================================
	// 定数
public:

	//======================================================================
	// メソッド

	// - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
	// アクセサ
public:

	// - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
	// 外部サービス
public:
	void begin(u32 param);
	void end();

	// - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
	// 内部制御
public:
	StEmp_10202_1001_AsaOnlyEvent();

	//======================================================================
	// 変数
protected:
};

SRCR_END_NS

////////////////////////////////////////////////////////////////////////////

#endif	// _SRCR_EPISODE_STEMP_IMPLEMENT_ST_EMP_10202_1001_ASA_ONLY_EVENT_H_
