/***********************************************************************//**
 *  MaterialCtx.h
 *  Terras Framework
 *
 *  Created by Ryoutarou Kishi on 2009/12/29.
 *  Copyright 2009 Altoterras Corporation. All rights reserved.
 *
**//***********************************************************************/

#ifndef _TFW_G3D_MATERIAL_CTX_H_
#define _TFW_G3D_MATERIAL_CTX_H_

////////////////////////////////////////////////////////////////////////////
// インクルードファイル

#include "../Base.h"

////////////////////////////////////////////////////////////////////////////
// クラス

TFW_BEGIN_NS

class Texture;
class TextureCtx;

/*---------------------------------------------------------------------*//**
 *	マテリアル 可変値コンテキスト
 *
**//*---------------------------------------------------------------------*/
class MaterialCtx
{
	//======================================================================
	// メソッド

	// - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
	// 内部制御
public:
	MaterialCtx();
	~MaterialCtx();
	bool create(Texture* tex);
	void destroy();

	//======================================================================
	// メンバ変数
public:
	TextureCtx* _texctx;
};

TFW_END_NS

////////////////////////////////////////////////////////////////////////////

#endif	// _TFW_G3D_MATERIAL_CTX_H_