/***********************************************************************//**
 *	Ui.h
 *	Terras Framework
 *
 *	Created by Ryoutarou Kishi on 2009/06/03.
 *	Copyright 2009 Altoterras Corporation. All rights reserved.
 *
**//***********************************************************************/

#ifndef _TFW_UI_UI_H_
#define _TFW_UI_UI_H_

////////////////////////////////////////////////////////////////////////////
// インクルードファイル

#include "../Base.h"

#include "../framemod/FrameExec.h"

////////////////////////////////////////////////////////////////////////////
// クラス

TFW_BEGIN_NS

class View;

/*---------------------------------------------------------------------*//**
 *	ユーザーインターフェイス基底クラス
 *	
**//*---------------------------------------------------------------------*/
class Ui
{
	//======================================================================
	// 定数
protected:
	static const u32 EF_REACTED			= 0x00000001;	// タップ、もしくはリリースに反応済みである

	//======================================================================
	// メソッド

	// - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
	// アクセサ
public:
	// 反応済みフラグを得る
	inline bool	isReacted() const { return TFW_IS_FLAG(_eflags, EF_REACTED); }

	// - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
	// 外部サービス
public:
	inline void	setReacted(bool isReacted) { TFW_SET_FLAG(_eflags, EF_REACTED, isReacted); }

	// - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
	// 内部制御
public:
	Ui();
	virtual ~Ui();
	virtual void exec() = 0;

	//======================================================================
	// 変数
protected:
	u32			_eflags;			// 実行フラグ（反応済みフラグ等）
};

TFW_END_NS

////////////////////////////////////////////////////////////////////////////

#endif	// _TFW_UI_UI_H_