/***********************************************************************//**
 *	SerializeBase.h
 *	Terras Framework
 *	
 *	Created by Ryoutarou Kishi on 2010/03/23.
 *	Copyright 2010 Altoterras Corporation. All rights reserved.
 *
**//***********************************************************************/

#ifndef _TFW_SERIALIZE_SERIALIZE_BASE_H_
#define _TFW_SERIALIZE_SERIALIZE_BASE_H_

////////////////////////////////////////////////////////////////////////////
// インクルードファイル

#include "../Base.h"

////////////////////////////////////////////////////////////////////////////
// クラス

TFW_BEGIN_NS

class Serializer;

/*---------------------------------------------------------------------*//**
 *	直列化対応基底インターフェイス
 *	
**//*---------------------------------------------------------------------*/
TFW_INTERFACE SerializeBase
{
	//======================================================================
	// メソッド

	// - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
	// アクセサ
public:

	// - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
	// 外部サービス
public:
	virtual bool serialize(Serializer* ser) const = 0;
	virtual bool deserialize(Serializer* ser) = 0;

	// - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
	// 内部制御
public:
};

TFW_END_NS

////////////////////////////////////////////////////////////////////////////

#endif	// _TFW_SERIALIZE_SERIALIZE_BASE_H_