/***********************************************************************//**
 *	StringHashEntry.h
 *	Terras Framework
 *
 *	Created by Ryoutarou Kishi on 2009/10/23.
 *	Copyright 2009 Altoterras Corporation. All rights reserved.
 *
**//***********************************************************************/

#ifndef _TFW_HASH_STRING_HASH_ENTRY_H_
#define _TFW_HASH_STRING_HASH_ENTRY_H_

////////////////////////////////////////////////////////////////////////////
// インクルードファイル

#include "HashEntry.h"

////////////////////////////////////////////////////////////////////////////
// クラス

TFW_BEGIN_NS

class VcString;

/*---------------------------------------------------------------------*//**
 *	文字列ハッシュエントリ
 *
**//*---------------------------------------------------------------------*/
class StringHashEntry : public HashEntry
{
	//======================================================================
	// メソッド

	// - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
	// アクセサ
public:
	VcString*	getString() const			{	return _str;	}
	void		setString(VcString* str)	{	_str = str;	}

	// - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
	// 外部サービス
public:
	StringHashEntry() : _str(0L) {}

	//======================================================================
	// メンバ変数
private:
	VcString* _str;
};

TFW_END_NS

////////////////////////////////////////////////////////////////////////////

#endif	// _TFW_HASH_STRING_HASH_ENTRY_H_
