/***********************************************************************//**
 *  SgEntity.h
 *  Terras Framework
 *
 *  Created by Ryoutarou Kishi on 2009/04/14.
 *  Copyright 2009 Altoterras Corporation. All rights reserved.
 *
**//***********************************************************************/

#ifndef _TFW_G3D_SG_NODE_SG_ENTITY_H_
#define _TFW_G3D_SG_NODE_SG_ENTITY_H_

////////////////////////////////////////////////////////////////////////////
// インクルードファイル

#include "../../../Base.h"

#include "SgNode.h"
	
////////////////////////////////////////////////////////////////////////////
// クラス

TFW_BEGIN_NS

class Model;

/*---------------------------------------------------------------------*//**
	シーングラフノード要素クラス

**//*---------------------------------------------------------------------*/
class SgEntity : public SgNode
{
};
	
TFW_END_NS

////////////////////////////////////////////////////////////////////////////

#endif	// _TFW_G3D_SG_NODE_SG_ENTITY_H_

