/***********************************************************************//**
 *	Env.cpp
 *	Envelopment Terras Kit
 *
 *	Created by Ryoutarou Kishi on 2010/05/11.
 *	Copyright 2010 Altoterras Corporation. All rights reserved.
 *
**//***********************************************************************/

////////////////////////////////////////////////////////////////////////////
// インクルードファイル

// Env

// Self
#include "Env.h"

// Friends
#include "EtkBody.h"

// External

// Library

////////////////////////////////////////////////////////////////////////////
// 関数

namespace etk
{

/*---------------------------------------------------------------------*//**
	言語 ID を得る
**//*---------------------------------------------------------------------*/
LangId Env_getLangId()
{
	return (LangId)EtkBody::getBody()->getLangId();
}

/*---------------------------------------------------------------------*//**
	高解像度かを得る
**//*---------------------------------------------------------------------*/
bool Env_isHdResolution()
{
	return TFW_IS_FLAG(EtkBody::getBody()->getResolutionFlags(), EtkBody::RSLF_HD);
}

/*---------------------------------------------------------------------*//**
	Retina 解像度かを得る
**//*---------------------------------------------------------------------*/
bool Env_isRdResolution()
{
	return TFW_IS_FLAG(EtkBody::getBody()->getResolutionFlags(), EtkBody::RSLF_RD);
}

#if 0
/*---------------------------------------------------------------------*//**
	ワイド解像度かを得る
**//*---------------------------------------------------------------------*/
bool Env_isWdResolution()
{
	return TFW_IS_FLAG(EtkBody::getBody()->getResolutionFlags(), EtkBody::RSLF_WD);
}
#endif

/*---------------------------------------------------------------------*//**
	2D 解像描画比を得る
**//*---------------------------------------------------------------------*/
f32 Env_get2drRate()
{
	return EtkBody::getBody()->get2drRate();
}

}	// namespace enlt
