/***********************************************************************//**
 *  EtkNotifier.h
 *  Envelopment Terras Kit
 *
 *	Created by Ryoutarou Kishi on 2014/04/14.
 *	Copyright 2014 Altoterras Corporation. All rights reserved.
 *
**//***********************************************************************/

#ifndef _ETK_BODY_ETK_NOTIFIER_H_
#define _ETK_BODY_ETK_NOTIFIER_H_

////////////////////////////////////////////////////////////////////////////
// インクルードファイル

#include "../Base.h"

////////////////////////////////////////////////////////////////////////////
// クラス

ETK_BEGIN_NS

/*---------------------------------------------------------------------*//**
 *	標準通知基底クラス
 *		※	現在は、呼び出し先を直接固定的に書き込んでいるが、
 *			呼び出しインターフェイスを定義した上で、
 *			呼び出されたい者が GameNotifier に対して自ら登録するように
 *			拡張した方が良いかもしれない．
 *
**//*---------------------------------------------------------------------*/
class EtkNotifier
{
	//======================================================================
	// メソッド

	// - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
	// 外部サービス
public:
	virtual void notifyChangeLanguage();
	virtual void notifyChangeLogicalScreenSize();

	// - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
	// 内部制御
public:
	EtkNotifier();
	virtual ~EtkNotifier() {}
	virtual bool create();
	virtual void destroy();

	//======================================================================
	// 変数
private:
};

ETK_END_NS

////////////////////////////////////////////////////////////////////////////

#endif	// _ETK_BODY_ETK_NOTIFIER_H_
