/***********************************************************************//**
 *	PrpzlMenuMode.h
 *	Enlight Game Application
 *
 *	Created by Ryoutarou Kishi on 2011/02/23.
 *	Copyright 2011 Altoterras Corporation. All rights reserved.
 *
**//***********************************************************************/

////////////////////////////////////////////////////////////////////////////
// インクルードファイル

// Base

// Self
#include "PrpzlMenuMode.h"

// Friends
#include "PrpzlMenuRole.h"
#include "../../../body/Game.h"

// External

// Library

////////////////////////////////////////////////////////////////////////////

SRCR_BEGIN_NS

////////////////////////////////////////////////////////////////////////////
// クラス

//==========================================================================
// PrpzlMenuMode メソッド

// - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
// 内部制御

/*---------------------------------------------------------------------*//**
	コンストラクタ
**//*---------------------------------------------------------------------*/
PrpzlMenuMode::PrpzlMenuMode(PrpzlOperationData* opdat)
	: _opdatRef(opdat)
{
}

/*---------------------------------------------------------------------*//**
	作成
**//*---------------------------------------------------------------------*/
bool PrpzlMenuMode::create()
{
	if(!GameModeBase::create(0, 0, new PrpzlMenuRole(_opdatRef)))
	{
		return false;
	}

	return true;
}

/*---------------------------------------------------------------------*//**
	開始
**//*---------------------------------------------------------------------*/
bool PrpzlMenuMode::notifyBegin(void* objParamRef)
{
	// ロールコマンド設定
	getSelfRole()->reset();
	getSelfRole()->stackCommand(PrpzlMenuRole::STABLE, 0L);
	getSelfRole()->begin();

	return true;
}

/*---------------------------------------------------------------------*//**
	終了
**//*---------------------------------------------------------------------*/
void PrpzlMenuMode::notifyEnd(void* objParamRef)
{
	getSelfRole()->end();
}

////////////////////////////////////////////////////////////////////////////

SRCR_END_NS
