/***********************************************************************//**
 *	EventMatterPresvParam.h
 *	Enlight Game Application
 *
 *	Created by Ryoutarou Kishi on 2010/11/30.
 *	Copyright 2009 Altoterras Corporation. All rights reserved.
 *
**//***********************************************************************/

#ifndef _SRCR_EVENT_MATTER_EVENT_MATTER_PRESV_PARAM_H_
#define _SRCR_EVENT_MATTER_EVENT_MATTER_PRESV_PARAM_H_

////////////////////////////////////////////////////////////////////////////
// インクルードファイル

#include "../../Base.h"

////////////////////////////////////////////////////////////////////////////
// クラス

SRCR_BEGIN_NS

/*---------------------------------------------------------------------*//**
 *	イベント マター保持パラメータ
 *
**//*---------------------------------------------------------------------*/
class EventMatterPresvParam
{
	//======================================================================
	// 定数
public:
	enum Kind
	{
		KIND_NULL,
		KIND_QUEST,
	};

	//======================================================================
	// メソッド

	// - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
	// 内部制御
public:
	EventMatterPresvParam()
		: _kind(KIND_NULL)
		, _d(0L)
	{
	}

	//======================================================================
	// 変数
public:
	Kind _kind;
	const void* _d;
};

SRCR_END_NS

////////////////////////////////////////////////////////////////////////////

#endif	// _SRCR_EVENT_MATTER_EVENT_MATTER_PRESV_PARAM_H_
