/***********************************************************************//**
 *	AtArSceneParam.h
 *	Enlight AtAr Application
 *
 *	Created by Ryoutarou Kishi on 2013/06/18.
 *	Copyright 2013 Altoterras Corporation. All rights reserved.
 *
**//***********************************************************************/

#ifndef _ATAR_BODY_AT_AR_SCENE_PARAM_H_
#define _ATAR_BODY_AT_AR_SCENE_PARAM_H_

////////////////////////////////////////////////////////////////////////////
// インクルードファイル

#include "../Base.h"

////////////////////////////////////////////////////////////////////////////
// クラス

ATAR_BEGIN_NS

/*---------------------------------------------------------------------*//**
 *	シーンパラメータ（現在未使用；将来的に渡すパラメータが増えたら使う予定）
 *
**//*---------------------------------------------------------------------*/
class AtArSceneParam
{
	//======================================================================
	// メソッド
public:
	AtArSceneParam()
		: _idMatched(0L)
	{
	}

	//======================================================================
	// 変数
public:
	const CStringBase* _idMatched;
};

ATAR_END_NS

////////////////////////////////////////////////////////////////////////////

#endif	// _ATAR_BODY_AT_AR_SCENE_PARAM_H_
