/***********************************************************************//**
 *	TorchIos.h
 *	Terras Frameork
 *	
 *	Created by Ryoutarou Kishi on 2013/07/27.
 *	Copyright 2013 Altoterras Corporation. All rights reserved.
 *
**//***********************************************************************/

#ifndef _ATAR_BODY_TORCH_IOS_H_
#define _ATAR_BODY_TORCH_IOS_H_

////////////////////////////////////////////////////////////////////////////
// インクルードファイル

#include "../Base.h"

////////////////////////////////////////////////////////////////////////////
// クラス

ATAR_BEGIN_NS

/*---------------------------------------------------------------------*//**
 * 懐中電灯（iOS）
 *
**//*---------------------------------------------------------------------*/
class TorchIos
{
	//======================================================================
	// メソッド

	// - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
	// アクセサ
public:
	inline bool isLighting() const { return _on; }

	// - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
	// 外部サービス
public:
	void startLighting();
	void stopLighting();
	bool hasDevice() const;
	void updateDevice();

	// - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
	// 内部制御
public:
	TorchIos();
	~TorchIos();
	bool create();
	void destroy();

	//======================================================================
	// 変数
private:
	bool _on;
};

ATAR_END_NS

////////////////////////////////////////////////////////////////////////////

#endif	// _ATAR_BODY_TORCH_IOS_H_