/***********************************************************************//**
 *	Font.cpp
 *	Terras Framework
 *
 *	Created by Ryoutarou Kishi on 2009/06/06.
 *	Copyright 2009 Altoterras Corporation. All rights reserved.
 *
**//***********************************************************************/

////////////////////////////////////////////////////////////////////////////
// インクルードファイル

// Base

// Self
#include "Font.h"

// Friends
#include "../../lib/Vector.h"
#include "../../txt/TxtChar.h"
#include "../../txt/TxtIterator.h"
#include "../../txt/implement/SjisTxt.h"

// External

// Library

////////////////////////////////////////////////////////////////////////////

TFW_BEGIN_NS

////////////////////////////////////////////////////////////////////////////
// クラス

////////////////////////////////////////////////////////////////////////////

TFW_END_NS
