/***********************************************************************//**
 *	ProportionalFontData.h
 *	Terras Framework
 *
 *	Created by Ryoutarou Kishi on 2010/12/07.
 *	Copyright 2010 Altoterras Corporation. All rights reserved.
 *
**//***********************************************************************/

#ifndef _TFW_G2D_FONT_PROPORTIONAL_FONT_DATA_H_
#define _TFW_G2D_FONT_PROPORTIONAL_FONT_DATA_H_

////////////////////////////////////////////////////////////////////////////
// インクルードファイル

#include "../../Base.h"
	
////////////////////////////////////////////////////////////////////////////
// クラス

TFW_BEGIN_NS

/*---------------------------------------------------------------------*//**
 *	プローポーショナル フォント データ
 *
**//*---------------------------------------------------------------------*/
class ProportionalFontData
{
	//======================================================================
	// 定数
private:
	static const s32 NUM_PCHAR = 95;	// 0x20 ' ' ～ 0x7e '~'

	//======================================================================
	// クラス
public:
	class ProportionalCharInfo
	{
	public:
		u8 _xStart;
		u8 _xEnd;
		
	public:
		ProportionalCharInfo() : _xStart(0), _xEnd(0) {}
	};

	//======================================================================
	// メソッド

	// - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
	// アクセサ
public:

	// - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
	// 外部サービス
public:

	// - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
	// 内部制御
public:

	//======================================================================
	// 変数
public:
	ProportionalCharInfo _pci[NUM_PCHAR];
};

TFW_END_NS

////////////////////////////////////////////////////////////////////////////

#endif	// _TFW_G2D_FONT_PROPORTIONAL_FONT_DATA_H_

