/***********************************************************************//**
 *	BasicInclude.h
 *	Enlight Android Application
 *
 *	Created by Ryoutarou Kishi on 2012/12/10.
 *	Copyright 2012 Altoterras Corporation. All rights reserved.
 *
**//***********************************************************************/

#pragma once

////////////////////////////////////////////////////////////////////////////
// マクロ

////////////////////////////////////////////////////////////////////////////
// インクルードファイル

// C ランタイム ヘッダー ファイル
#include <stdlib.h>
#include <malloc.h>
#include <memory.h>

////////////////////////////////////////////////////////////////////////////
// 構造体

/*
// フレーム情報
struct FrameInfo
{
	float	frame;
	float	dframe;
};
*/