/***********************************************************************//**
 *  PsnsAndroid.cpp
 *  Enlight Android Application
 *
 *	Created by Ryoutarou Kishi on 2012/12/10.
 *	Copyright 2012 Altoterras Corporation. All rights reserved.
 *
**//***********************************************************************/

////////////////////////////////////////////////////////////////////////////
// インクルードファイル

// Base

// Self
#include "PsnsAndroid.h"

// Friends
#include "../tfw/string/VcString.h"

// External

// Library

////////////////////////////////////////////////////////////////////////////

namespace app
{

////////////////////////////////////////////////////////////////////////////
// クラス

//==========================================================================
// PsnsAndroid メソッド

// - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
// 外部サービス

/*---------------------------------------------------------------------*//**
	現在のプレイヤー名を得る
**//*---------------------------------------------------------------------*/
bool PsnsAndroid::getCurrentPlayerId(tfw::VcString* idstr) const
{
#if defined(_DEBUG)
	if(!_validUserTest)	{	return false;	}
	*idstr = "###test_user_id###";	// test
	return true;
#else
	return false;
#endif
}

/*---------------------------------------------------------------------*//**
	スコアを更新する
**//*---------------------------------------------------------------------*/
bool PsnsAndroid::updateScore(u32 score)
{
	return false;
}

/*---------------------------------------------------------------------*//**
	トロフィーを更新する
**//*---------------------------------------------------------------------*/
bool PsnsAndroid::updateTrophy(s32 itp, u8 rate)
{
	return false;
}

/*---------------------------------------------------------------------*//**
	全トロフィーをリセットする
**//*---------------------------------------------------------------------*/
bool PsnsAndroid::resetTrophies()
{
	return false;
}

/*---------------------------------------------------------------------*//**
	有効な PSNS ユーザーアカウントがログインされているか
**//*---------------------------------------------------------------------*/
bool PsnsAndroid::isValidUserAccount()
{
#if defined(_DEBUG)
	return _validUserTest;
#else
	return false;
#endif
}

/*---------------------------------------------------------------------*//**
	PSNS ホーム画面を表示する
**//*---------------------------------------------------------------------*/
bool PsnsAndroid::showPsnsScreen(ScreenKind sk)
{
	ASSERT(false);	// not supported
	return false;
}

#if defined(_DEBUG)
/*---------------------------------------------------------------------*//**
	強制ユーザーアカウント有効性変更
**//*---------------------------------------------------------------------*/
void PsnsAndroid::debug_changeValidationUserAccountTest(bool validUser)
{
	_validUserTest = validUser;
}
#endif

// - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
// 内部制御

/*---------------------------------------------------------------------*//**
	コンストラクタ
**//*---------------------------------------------------------------------*/
PsnsAndroid::PsnsAndroid()
#if defined(_DEBUG)
	: _validUserTest(false)
#endif
{
}

////////////////////////////////////////////////////////////////////////////

}	// namespace app
