/***********************************************************************//**
 *	StopWatchAndroid.mm
 *	Enlight Android Application
 *	
 *	Created by Ryoutarou Kishi on 2012/12/15.
 *	Copyright 2012 Altoterras Corporation. All rights reserved.
 *
**//***********************************************************************/

////////////////////////////////////////////////////////////////////////////
// インクルードファイル

// Base
#include "StopWatchAndroid.h"

////////////////////////////////////////////////////////////////////////////
// クラス

//==========================================================================
// StopWatchAndroid メソッド

// - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
// 外部サービス

/*---------------------------------------------------------------------*//**
	コンストラクタ
**//*---------------------------------------------------------------------*/
StopWatchAndroid::StopWatchAndroid()
{
	_timePrev = getTimeNow();
}

/*---------------------------------------------------------------------*//**
	現在の時間を得る
**//*---------------------------------------------------------------------*/
TIMEVALUE StopWatchAndroid::getTimeNow()
{
	TIMEVALUE tv;
	gettimeofday(&tv, 0);
	return tv;
}

/*---------------------------------------------------------------------*//**
	時間の差を得る
**//*---------------------------------------------------------------------*/
TIMEVALUE StopWatchAndroid::subtractTime(TIMEVALUE a, TIMEVALUE b)
{
	TIMEVALUE tv;
	tv.tv_usec = a.tv_usec - b.tv_usec;
	tv.tv_sec = a.tv_sec - b.tv_sec + (tv.tv_usec / 1000000);
	tv.tv_usec %= 1000000;
	return tv;
}

/*---------------------------------------------------------------------*//**
	計測開始
**//*---------------------------------------------------------------------*/
void StopWatchAndroid::start()
{
	_timePrev = getTimeNow();
}

/*---------------------------------------------------------------------*//**
	経過時間を得る
**//*---------------------------------------------------------------------*/
f32 StopWatchAndroid::getElapsedSeconds()
{
	TIMEVALUE timeDiff = subtractTime(getTimeNow(), _timePrev);
	return timeDiff.tv_sec + (timeDiff.tv_usec * 0.000001f);
}
