/***********************************************************************//**
 *	UnitSaveStructure.h
 *	Enlight Game Application
 *
 *	Created by Ryoutarou Kishi on 2010/08/29.
 *	Copyright 2010 Altoterras Corporation. All rights reserved.
 *
**//***********************************************************************/

#ifndef _SRCR_UNIT_UNIT_SAVE_STRUCTURE_H_
#define _SRCR_UNIT_UNIT_SAVE_STRUCTURE_H_

////////////////////////////////////////////////////////////////////////////
// インクルードファイル

#include "../Base.h"

#include "../../tfw/lib/Vector.h"

////////////////////////////////////////////////////////////////////////////
// クラス

SRCR_BEGIN_NS

/*---------------------------------------------------------------------*//**
 *	ユニットのセーブストラクチャ
 *
**//*---------------------------------------------------------------------*/
class UnitSaveStructure
{
	//======================================================================
	// 定数
public:
	static const s32 SIZE_THIS = 16;

	//======================================================================
	// メソッド

	// - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
	// 内部制御
public:
	UnitSaveStructure()	{ TFW_ZERO_MEMORY(this, sizeof(UnitSaveStructure)); }

	//======================================================================
	// 変数
public:
	// [  0]
	u16 _aflags;						// [  2] 動作フラグ
	u8 __pad_0010[ 2];					// [  2]
	Vector3F _pos;						// [ 12] 位置
	// [ 16]
};

SRCR_END_NS

////////////////////////////////////////////////////////////////////////////

#endif	// _SRCR_UNIT_UNIT_SAVE_STRUCTURE_H_
