/***********************************************************************//**
 *	MapMod.h
 *	Enlight Game Application
 *
 *	Created by Ryoutarou Kishi on 2010/04/16.
 *	Copyright 2010 Altoterras Corporation. All rights reserved.
 *
**//***********************************************************************/

#ifndef _SRCR_EPISODE_MAPMOD_MAP_MOD_H_
#define _SRCR_EPISODE_MAPMOD_MAP_MOD_H_

////////////////////////////////////////////////////////////////////////////
// インクルードファイル

#include "../../Base.h"

////////////////////////////////////////////////////////////////////////////
// クラス

SRCR_BEGIN_NS

class Game;

/*---------------------------------------------------------------------*//**
 *	マップ毎の専用処理モジュール
 *		※タイトル及びマップ依存の処理を行う
 *		　原則的には、可能な限りイベントで実装すべきだが、
 *		　イベントのみで実装が困難な場合はこのモジュールを実装する
 *			実装方法の検討は以下の順で考えるべきである
 *				(1) 既存の EventMatter のみで実装する
 *				　　↓
 *				(2) マップ専用の MapEmp で実装する
 *				　　↓
 *				(3) 最終手段としてこのモジュールを派生して実装する
 *
**//*---------------------------------------------------------------------*/
class MapMod : public FrameExec
{
	//======================================================================
	// 定数
public:

	//======================================================================
	// メソッド

	// - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
	// 内部制御
public:
	MapMod();
	virtual bool create();
	virtual void destroy();
	virtual bool begin();
	virtual bool end();
	virtual void exec(ExecRes* res, const ExecCtx* ec) {}	// フレーム制御

	//======================================================================
	// 変数
protected:
};

////////////////////////////////////////////////////////////////////////////

SRCR_END_NS

#endif	// _SRCR_EPISODE_MAPMOD_MAP_MOD_H_
