/***********************************************************************//**
 *	EquipPlace.h
 *	Enlight Game Application
 *
 *	Created by Ryoutarou Kishi on 2010/06/16.
 *	Copyright 2009 Altoterras Corporation. All rights reserved.
 *
**//***********************************************************************/

#ifndef _SRCR_STATUS_EQUIP_PLACE_H_
#define _SRCR_STATUS_EQUIP_PLACE_H_

////////////////////////////////////////////////////////////////////////////
// インクルードファイル

#include "../Base.h"

////////////////////////////////////////////////////////////////////////////
// クラス

SRCR_BEGIN_NS

/*---------------------------------------------------------------------*//**
 *	装備箇所定義
 *		※	本来は、class に囲わずにダイレクトに enum を定義すれば
 *			いいのだが、標準の C++ 仕様では、EquipPlace::NUM_EQP と書けず、
 *			Java への自動変換が困難になる。
 *			したがって、ここでは class で囲んでいる。
 *
**//*---------------------------------------------------------------------*/
class EquipPlace
{
public:
	enum
	{
		EQP_LHAND,		// 左手
		EQP_RHAND,		// 右手
		EQP_ACCSR,		// アクセサリー
		NUM_EQP
	};
};

SRCR_END_NS

////////////////////////////////////////////////////////////////////////////

#endif	// _SRCR_STATUS_EQUIP_PLACE_H_
