/***********************************************************************//**
 *  FileSerializer.cpp
 *  Terras Framework
 *
 *	Created by Ryoutarou Kishi on 2010/03/23.
 *	Copyright 2010 Altoterras Corporation. All rights reserved.
 *
**//***********************************************************************/

////////////////////////////////////////////////////////////////////////////
// インクルードファイル

// Base

// Self
#include "FileSerializer.h"

// Friends
#include "FileBase.h"

// External

// Library

////////////////////////////////////////////////////////////////////////////

TFW_BEGIN_NS

////////////////////////////////////////////////////////////////////////////
// クラス

//==========================================================================
// FileSerializer メソッド

// - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
// アクセサ

// - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
// 外部サービス

/*---------------------------------------------------------------------*//**
	格納
**//*---------------------------------------------------------------------*/
bool FileSerializer::store(const void* val, s32 size)
{
	ASSERT(_file->isWriteMode());
	u32 sizeWrote = _file->write(val, size);
	return sizeWrote == size;
}

/*---------------------------------------------------------------------*//**
	復元
**//*---------------------------------------------------------------------*/
bool FileSerializer::restore(void* val, s32 size)
{
	ASSERT(_file->isReadMode());
	u32 sizeRead = _file->read(val, size);
	return sizeRead == size;
}

// - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
// 内部制御

/*---------------------------------------------------------------------*//**
	コンストラクタ
**//*---------------------------------------------------------------------*/
FileSerializer::FileSerializer()
	: _file(0L)
	, _isDeleteFileInstanceDelegating(false)
{
}

/*---------------------------------------------------------------------*//**
	コンストラクタ
**//*---------------------------------------------------------------------*/
FileSerializer::FileSerializer(FileBase* file)
	: _file(file)
	, _isDeleteFileInstanceDelegating(false)
{
}

/*---------------------------------------------------------------------*//**
	デストラクタ
**//*---------------------------------------------------------------------*/
FileSerializer::~FileSerializer()
{
	if(_isDeleteFileInstanceDelegating)
	{
		delete _file;
	}
}

/*---------------------------------------------------------------------*//**
	ファイルをセットする
**//*---------------------------------------------------------------------*/
void FileSerializer::setFile(FileBase* file, bool isDeleteFileInstanceDelegating)
{
	_file = file;
	_isDeleteFileInstanceDelegating = isDeleteFileInstanceDelegating;
}

////////////////////////////////////////////////////////////////////////////

TFW_END_NS