/***********************************************************************//**
 *	ScoreBase.cpp
 *	Enlight Game Application
 *
 *	Created by Ryoutarou Kishi on 2012/08/17.
 *	Copyright 2012 Altoterras Corporation. All rights reserved.
 *
**//***********************************************************************/

////////////////////////////////////////////////////////////////////////////
// インクルードファイル

// Base

// Self
#include "ScoreBase.h"

// Friends

// External
#include "../../tfw/psns/PsnsBase.h"
#include "../../tfw/serialize/Serializer.h"

// Library

////////////////////////////////////////////////////////////////////////////

SRCR_BEGIN_NS

////////////////////////////////////////////////////////////////////////////
// クラス

//==========================================================================
// ScoreBase メソッド

// - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
// アクセサ

/*---------------------------------------------------------------------*//**
	スコアカウントを得る
**//*---------------------------------------------------------------------*/
u16 ScoreBase::getScoreCount(s32 sc) const
{
	if((sc < 0) || (NUM_SCORE_MAX <= sc))	{	ASSERT(false);	return 0;	}
	return _scrcnt[sc];
}

// - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
// 外部サービス

/*---------------------------------------------------------------------*//**
	スコアアップ
**//*---------------------------------------------------------------------*/
void ScoreBase::upScore(s32 sc)
{
	if((sc < 0) || (NUM_SCORE_MAX <= sc))	{	ASSERT(false);	return;	}

	if(_scrcnt[sc] < U16_MAX)
	{
		_scrcnt[sc]++;
	}
}

/*---------------------------------------------------------------------*//**
	PSNS のスコアを更新する
**//*---------------------------------------------------------------------*/
bool ScoreBase::updatePsnsScore()
{
	if(_psnsRef == 0L)	{	return false;	}
	u32 score = calcScore();
	// PSNS スコア情報の更新
	return _psnsRef->updateScore(score);
}

// - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
// 内部制御

/*---------------------------------------------------------------------*//**
	コンストラクタ
**//*---------------------------------------------------------------------*/
ScoreBase::ScoreBase(PsnsBase* psnsRef)
	: _psnsRef(psnsRef)
{
	TFW_ZERO_MEMORY(_scrcnt, sizeof(u16) * NUM_SCORE_MAX);
}

////////////////////////////////////////////////////////////////////////////

SRCR_END_NS
