/***********************************************************************//**
 *	GameModeParam.h
 *	Enlight Game Application
 *
 *	Created by Ryoutarou Kishi on 2012/06/29.
 *	Copyright 2012 Altoterras Corporation. All rights reserved.
 *
**//***********************************************************************/

#ifndef _DIMZ_MODE_GAME_MODE_PARAM_H_
#define _DIMZ_MODE_GAME_MODE_PARAM_H_

////////////////////////////////////////////////////////////////////////////
// インクルードファイル

#include "../Base.h"

////////////////////////////////////////////////////////////////////////////
// クラス

DIMZ_BEGIN_NS

/*---------------------------------------------------------------------*//**
 *	ゲームモード汎用パラメータ
 *
**//*---------------------------------------------------------------------*/
class GameModeParam
{
	//======================================================================
	// 定数
public:
	static const u32	F__DUMMY_					=	0x00000001;

	//======================================================================
	// メソッド

	// - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
	// プロパティ
public:
	// フラグを得る
	inline u32 getFlags() const { return _flags; }

	// フラグを設定する
	inline void setFlags(u32 flag, bool isValid) { TFW_SET_FLAG(_flags, flag, isValid); }
	// フラグをクリアする
	inline void clearFlags() { _flags = 0; }

	// - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
	// 内部制御
public:
	GameModeParam() : _flags(0) {}

	//======================================================================
	// 変数
private:
	u32	_flags;
};

DIMZ_END_NS

////////////////////////////////////////////////////////////////////////////

#endif	// _DIMZ_MODE_GAME_MODE_PARAM_H_
