/***********************************************************************//**
 *	MapObjUnit.h
 *	Enlight Game Application
 *
 *	Created by Ryoutarou Kishi on 2010/07/16.
 *	Copyright 2010 Altoterras Corporation. All rights reserved.
 *
**//***********************************************************************/

#ifndef _SRCR_UNIT_CHAR_NPC_MAP_OBJ_UNIT_H_
#define _SRCR_UNIT_CHAR_NPC_MAP_OBJ_UNIT_H_

////////////////////////////////////////////////////////////////////////////
// インクルードファイル

#include "NpcCharUnit.h"

////////////////////////////////////////////////////////////////////////////
// クラス

TFW_BEGIN_NS

class Model;

TFW_END_NS

SRCR_BEGIN_NS

class ExtraSpirit;

/*---------------------------------------------------------------------*//**
 *	マップ仕掛けユニット
 *
**//*---------------------------------------------------------------------*/
class MapObjUnit : public NpcCharUnit
{
	//======================================================================
	// 定数
public:

	//======================================================================
	// メソッド

	// - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
	// アクセサ
public:

	// - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
	// 外部サービス
public:

	// - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
	// 内部制御
public:
	MapObjUnit();
	virtual ~MapObjUnit();
	virtual bool create(u16 chrdid);

protected:

	//======================================================================
	// 変数
protected:

private:
};

SRCR_END_NS

////////////////////////////////////////////////////////////////////////////

#endif	// _SRCR_UNIT_CHAR_NPC_MAP_OBJ_UNIT_H_
