/***********************************************************************//**
 *	SourceDef.cpp
 *	Enlight Game Application
 *
 *	Created by Ryoutarou Kishi on 2010/03/12.
 *	Copyright 2010 Altoterras Corporation. All rights reserved.
 *
**//***********************************************************************/

////////////////////////////////////////////////////////////////////////////
// インクルードファイル

// Base

// Self
#include "SourceDef.h"

// Friends

// External
#include "../../es/kwset/JsKeywordSet.h"
#include "../../es/kwset/SsKeywordSet.h"

SRCR_BEGIN_NS

////////////////////////////////////////////////////////////////////////////
// 静的変数

static JsKeywordSet s_kwsetJs;
static SsKeywordSet s_kwsetSs;

////////////////////////////////////////////////////////////////////////////
// クラス

//==========================================================================
// SourceDef 静的変数

EsKeywordSet* SourceDef::_kwsets[NUM_SRCKIND] =
{
	0L,
	&s_kwsetSs,
	&s_kwsetJs,
};

//==========================================================================
// SourceDef メソッド

// - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
// アクセサ

// - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
// 外部サービス

// - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
// 内部制御

////////////////////////////////////////////////////////////////////////////

SRCR_END_NS
