/***********************************************************************//**
 *	Situation.h
 *	Enlight Game Application
 *
 *	Created by Ryoutarou Kishi on 2010/04/18.
 *	Copyright 2010 Altoterras Corporation. All rights reserved.
 *
**//***********************************************************************/

#ifndef _SRCR_EPISODE_SITUATION_H_
#define _SRCR_EPISODE_SITUATION_H_

////////////////////////////////////////////////////////////////////////////
// インクルードファイル

#include "../Base.h"

////////////////////////////////////////////////////////////////////////////
// クラス

SRCR_BEGIN_NS

class Game;

/*---------------------------------------------------------------------*//**
 *	シチュエーション
 *		※タイトル依存
 *
**//*---------------------------------------------------------------------*/
class Situation
{
	//======================================================================
	// 定数
public:
	// カテゴリ 01 シチュエーション フラグ
	static const u16 SF_C01_ASA_ONLY	= 0x0001;		// アサのみ
	static const u16 SF_C01_BE_COPRO	= 0x0002;		// コルポがいる

	//======================================================================
	// メソッド

	// - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
	// 外部サービス
public:
	u16 getCurrentSituationFlags(int category) const;

	// - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
	// 内部制御
public:
	Situation();
	~Situation();
	bool create();
	void destroy();

	//======================================================================
	// 変数
private:
};

SRCR_END_NS

////////////////////////////////////////////////////////////////////////////

#endif	// _SRCR_EPISODE_SITUATION_H_
