/***********************************************************************//**
 *  WStringBase.h
 *  Terras Framework
 *
 *  Created by Ryoutarou Kishi on 2012/12/05.
 *  Copyright 2012 Altoterras Corporation. All rights reserved.
 *
**//***********************************************************************/

#ifndef _TFW_STRING_W_STRING_BASE_H_
#define _TFW_STRING_W_STRING_BASE_H_

#if 1
////////////////////////////////////////////////////////////////////////////
// インクルードファイル

// Base
#include "../Base.h"

// Friends
#include "StringBase.h"

// External

// Library

TFW_BEGIN_NS

////////////////////////////////////////////////////////////////////////////
// クラス

/*---------------------------------------------------------------------*//**
 *	文字列基底クラス
 *
**//*---------------------------------------------------------------------*/
class WStringBase : public StringBase<u16>
{
};

////////////////////////////////////////////////////////////////////////////

TFW_END_NS
#else
////////////////////////////////////////////////////////////////////////////
// インクルードファイル

#include "../Base.h"

////////////////////////////////////////////////////////////////////////////
// クラス

TFW_BEGIN_NS

/*---------------------------------------------------------------------*//**
 *	文字列基底クラス
 *
**//*---------------------------------------------------------------------*/
class WStringBase
{
public:
	virtual const u16* getRaw(int index = 0) const = 0;
	virtual	int getLength() const = 0;
	virtual	u16 getAt(int index) const = 0;
};

TFW_END_NS

////////////////////////////////////////////////////////////////////////////
#endif

#endif	// _TFW_STRING_W_STRING_BASE_H_
