/***********************************************************************//**
 *	EsItNodeFactory.h
 *	Enlight Script
 *
 *	Created by Ryoutarou Kishi on 2009/10/27.
 *	Copyright 2009 Altoterras Corporation. All rights reserved.
 *
**//***********************************************************************/

#ifndef _ES_ES_IT_NODE_FACTORY_H_
#define _ES_ES_IT_NODE_FACTORY_H_

////////////////////////////////////////////////////////////////////////////
// インクルードファイル

#include "EsBase.h"

#include "EsItNode.h"

////////////////////////////////////////////////////////////////////////////
// クラス

ES_BEGIN_NS

class EsContext;

/*---------------------------------------------------------------------*//**
 *	命令ツリーノード
 *
**//*---------------------------------------------------------------------*/
class EsItNodeFactory
{
	//======================================================================
	// 定数
private:

	//======================================================================
	// メソッド

	// - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
	// 外部サービス
public:
	EsItNodeFactory();
	~EsItNodeFactory();
	EsItNode*		make(EsContext* ctx, EsNodeType nt);

private:
	s8*				getFreeBuffer();

	//======================================================================
	// 変数
private:
	s32				_sizeNode;
	s8*				_bufPool;
	s32				_sizePoolBuf;
	s32				_idxCur;
	s32				_numNode;
};

ES_END_NS

////////////////////////////////////////////////////////////////////////////

#endif	// _ES_ES_IT_NODE_FACTORY_H_
