/***********************************************************************//**
 *	EsUnit.h
 *	Enlight Script
 *
 *	Created by Ryoutarou Kishi on 2010/06/02.
 *	Copyright 2010 Altoterras Corporation. All rights reserved.
 *
**//***********************************************************************/

#ifndef _ES_ES_UNIT_H_
#define _ES_ES_UNIT_H_

////////////////////////////////////////////////////////////////////////////
// インクルードファイル

#include "EsBase.h"

////////////////////////////////////////////////////////////////////////////
// クラス

ES_BEGIN_NS

/*---------------------------------------------------------------------*//**
 *	ES 最小単位オブジェクト
 *
**//*---------------------------------------------------------------------*/
class EsUnit
{
	//======================================================================
	// 定数
private:
	// フラグ
	static const u32	UF_GARBAGE	= 0x00000001;	// 削除可能

	//======================================================================
	// メソッド

	// - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
	// アクセサ
public:
	// 解析時のみのオブジェクトである
	virtual bool isParseTimeOnly() const { return false; }
	// 削除可能である
	inline bool isGarbage() const { return TFW_IS_FLAG(_uflags, UF_GARBAGE); }

	// 削除可能にする
	inline void becomeGarbage() { TFW_SET_FLAG(_uflags, UF_GARBAGE, true); }

	// - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
	// 内部制御
public:
	EsUnit() : _uflags(0) {}
	virtual ~EsUnit() {}

	//======================================================================
	// 変数
private:
	u32	_uflags;
};

ES_END_NS

////////////////////////////////////////////////////////////////////////////

#endif	// _ES_ES_UNIT_H_
